{
  "records": [
    {
      "id": 20,
      "uuid": "0a709c00-c3f2-442a-ad3e-e399d611de5d",
      "@type": "Scenario",
      "steps": {
        "Steps": [
          {
            "name": "Sudden Increase in Failed Logons To A Host",
            "type": "executePlaybook",
            "playbookIRI": "/api/3/workflows/84dc0fa4-b83d-4236-b35f-6580eaa475c0",
            "preCreateMessage": "Creating demo record for Brute force Attempt captured in FortiSIEM ",
            "postCreateMessage": "",
            "waitTimeforNextStep": "0"
          }]
      },
      "title": "Demo - BFA",
      "comments": null,
      "createDate": 1620032989,
      "createUser": "/api/3/people/3451141c-bac6-467c-8d72-85e0fab569ce",
      "modifyDate": 1620035759,
      "modifyUser": "/api/3/appliances/57545210-2adc-472b-a24f-2df6ee8dfe63",
      "recordTags": [
        "FortiSIEM",
        "BFA"],
      "description": "A brute force attack is a hacking method that uses trial and error to crack passwords, login credentials, and encryption keys. It is a simple yet reliable tactic for gaining unauthorized access to individual accounts and organizations’ systems and networks. The hacker tries multiple usernames and passwords, often using a computer to test a wide range of combinations, until they find the correct login information.\n\nThe name \"brute force\" comes from attackers using excessively forceful attempts to gain access to user accounts. Despite being an old cyberattack method, brute force attacks are tried and tested and remain a popular tactic with hackers.\n\nBrute force attack tools include password-cracking applications, which crack username and password combinations that would be extremely difficult for a person to crack on their own. Commonly used brute force attack tools include:\n\nAircrack-ng: A suite of tools that assess Wi-Fi network security to monitor and export data and attack an organization through methods like fake access points and packet injection.\nJohn the Ripper: An open-source password recovery tool that supports hundreds of cipher and hash types, including user passwords for macOS, Unix, and Windows, database servers, web applications, network traffic, encrypted private keys, and document files.",
      "configDeployed": null,
      "createdAlertsID": "[\"/api/3/alerts/346555b2-41b0-4009-984e-31ab1d4ae600\"]"
    }],
  "type": "scenario"
}